// // Создайте переменную a. Запишите в нее значение 10, выведите его на экран с помощью метода alert(). Затем запишите в нее значение 20, выведите его на экран.

// let a = alert (10);
// a = 20;
// alert (a);

// //2.  Создайте переменную и присвойте ей значение года выпуска первого iPhone. Выведите значение переменной на экран.

// const ageiPhone = 2007;
// alert (ageiPhone);

// //3.  Создайте переменную и присвойте ей значение имени создателя языка JavaScript. Выведите значение переменной на экран. 

// const nameCreator = alert ("Эйх Брендан");

// //4.  Создайте две переменные 10 и 2. С помощью метода alert() выведите на экран их сумму, разность, произведение и частное (результат деления).

// let a = 10;
// let b = 2;
// alert (a+b);
// alert (a-b);
// alert (a*b);
// alert (a/b);




// // 5. Возведите `2` в `5`-ю степень. Результат запишите в переменную `result` и выведите на экран с помощью метода `alert()`.

// let result = 2 ** 5;
// alert (result);

// // 6. Даны переменные: `a = 9` и ****`b = 2`. Найдите **остаток от деления** `a` на `b` и выведите результат на экран с помощью метода `alert()`.


// let a = 9;
// let b = 2;
// alert (a % b);



// 7. Перепишите код с использованием операторов присваивания и инкремента/декремента (количество строк должно остаться прежним):

//     let num = 1;
//     num += 5;
//     num -= 3;
//     num *= 7;
//     num /=3;
//     num++;
//     num--;
//     alert(num);


// 8. Создайте переменную `age`, присвойте значение с помощью метода `prompt()` “Сколько вам лет?”. 

// let age = Number (prompt ( `Сколько вам лет?`))
// alert (`Вам ${age}`)


// 9.0 Создайте объект user, у которого есть следующие свойства: name, age, isAdmin. Значения для свойств придумайте произвольные. Обратите вниманnameзначение должно быть строковым, для 
// age – числовым, а для isAdmin – булевым.


// let user = {
//     name: "John";
//     age: 25;
//     isAdmin: true;
// };

// 9.1 Добавьте объекту user свойство city of residence. Обратите внимание на то, как правильно добавлять такие методы: через точку или с помощью квадратных скобок.


// let user = {
//     name: "John";
//     age: 25;
//     isAdmin: true;
//     user.city of residence = "Samara";
// };

// 9.2 Измените у объекта user свойство age на любое другое новое значение.

// let user = {
//     name: "John";
//     age: 25;
//     isAdmin: true;
// user.age = 27;
// };

// 9.3 удалите у объекта user свойство "city of residence".

// let user = {
//     name: "John";
//     age: 25;
//     isAdmin: true;
//     user.city of residence = "Samara";
//     delete user.city of residence
// };





    
//  9.4 Создайте переменную info, присвойте ей значение с помощью метода prompt() "Какую информацию хотите узнать о пользователе?". Далее обращайтесь к свойствам объекта userчерез переменную info. Выведите результат с помощью alert.






// // 10. С помощью метода `prompt()` спросите у пользователя его имя и сохраните в переменную. С помощью метода `alert()` выведите на экран шаблонную строку: `Привет, ИМЯ!`
    
// //     **Подсказка: вставить `!` можно через кавычки*
    
// let name = prompt ('Как вас зовут?');
// alert (`Привет ${name}!`);



